// Завдання 2.2. 
// Скласти програму для розв’язання поданої задачі за допомогою оператора вибору. 
// 11.	По введеному номеру одиниці виміру (1 - міліметр, 2 - сантиметр, 3 - метр, 4 - дециметр, 5 - кілометр) 
// і довжині відрізка L вивести на екран відповідне значення довжини відрізка в метрах.

#include <iostream>
using namespace std;

int main() {
    int n;
    double L;
    cout << "Введіть номер одиниці виміру: ";
    cin >> n;
    cout << "Введіть довжину відрізка L: ";
    cin >> L;
    switch(n){
        case 1: cout << "\nДовжина відрізка - " << L / 1000 << " метрів"; break;
        case 2: cout << "\nДовжина відрізка - " << L / 100 << " метрів"; break;
        case 3: cout << "\nДовжина відрізка - " << L << " метрів"; break;
        case 4: cout << "\nДовжина відрізка - " << L / 10 << " метрів"; break;
        case 5: cout << "\nДовжина відрізка - " << L * 1000 << " метрів"; break;
        default: cout <<"\nПомилка";
    }
}