// Задано файл з DLL. Порахувати контрольну суму цього файлу і записати її в кінець DLL. Для підрахунку контрольної суми використовувати алгоритм, як для поштової скриньки
// Скласти функцію для перевірки контрольної суми при завантаженні DLL.
// Вставити перевірку контрольної суми в головну функцію DLL.
// Забезпечити автоматичне формування контрольної суми після змінення DLL.


#pragma once
#include <windows.h>

extern "C"
{
    __declspec(dllexport) int Add(int a, int b);
    __declspec(dllexport) void ShowMessage(const char* text);
}